<div class="b-easybank">
    <h2>EasyBank &mdash; это автоматизированный учет операций по банковским картам</h2>
    <p>Например, если Вы оплачиваете своей карточкой с подключенным EasyBank покупки в магазине, вам не нужно вносить
        информацию об этом вручную. Теперь данные автоматически обрабатываются системой, и Вам остается только их
        подтвердить.</p>
    <p>Проводите время с пользой и больше никаких стопок чеков, записок или электронных заметок. Так просто пользоваться
        банком с <em class="b-easybank-emphasize">EasyFinance.ru</em>!</p>

    <h3>Выберите свой банк для подключения автоматического учета по его картам:</h3>
    <div class="b-easybank-banks b-easybank-banks__citi">
        <h4 class="b-easybank-banks-title">CITIBANK</h4>
        <p><img src="/img/i/pix.gif" class="b-easybank-banks-descr"/><strong>CITIBANK</strong>, дочерний банк <a href="http://www.citigroup.com/" rel="nofollow">Citigroup</a>,
            крупнейшей финансовой группы, начал свою деятельность в России в 1993 году, став одним из первых российских банков
            с иностранным капиталом. Сегодня ЗАО КБ "Ситибанк" входит в <strong>ТОП-20</strong> российских банков
            и представлен в 12 городах России (Москва, Санкт-Петербург, Екатеринбург, Самара, Тольятти, Ростов-на-Дону,
            Волгоград, Нижний Новгород, Казань, Новосибирск, Уфа и в Рязань).</p>
        <p><a href="<?php echo url_for('easybank_citi_cashback'); ?>">Оформите кредитную карту Citibank CashBack</a>,
            пользуйтесь льготным периодом кредитования и <strong>зарабатывайте 1%</strong> с каждой покупки,
            попутно <a href="http://www.simpleshopping.ru/?icid=b5_simpleshopping2_rus" rel="nofollow">получая скидки от партнеров</a>.</p
    </div>


    <div class="b-easybank-banks b-easybank-banks__amt">
        <h4 class="b-easybank-banks-title">AMT BANK</h4>
        <p><img src="/img/i/pix.gif" class="b-easybank-banks-descr"/><strong>АМТ БАНК</strong> &mdash; динамично развивающийся банк, широко представленный в Москве,
            а также в Санкт-Петербурге, Владимире, Саратове, Калининграде, Воронеже, Волгоград, Астрахани, Ставрополе,
            Краснодаре, Новосибирске, Омске и Уфе.</p>
        <p>В 2009 году АМТ БАНК стал лауреатом Национальной премии «ИТ-лидер» в номинации «За выдающийся вклад в развитие
            информационных технологий», а также «Банк года», по версии Банки.ру, в номинации «2-е место в Народном рейтинге
            по итогам 2009 года».</p>
        <p><a href="<?php echo url_for('easybank_amt_easyfinance'); ?>">Оформите дебетовые карты AMT BANK</a>,
            в том числе золотые Visa и MasterCard, на льготных условиях и получите
            <a href="http://amtbank.com/ru/private/discount/">скидки и привилегии от партнеров</a>,
            а также контроль бюджета с <strong>EasyBank</strong>.</p>
    </div>


    <h2>Импорт данных из других программ и сервисов учета</h2>
    <p>Также есть возможность импорта данных из других сервисов, например, vkoshelke.ru. Он подробно описан
        в <a href="/my/wikiwrapper/tiki-index.php?page=Import">инструкции по импорту</a>.
</div>