<?php
/**
 * 404 Not Found
 */
?>
<div class="ramka3">
    <div class="ct">
        <div class="head">
            <h2>Запрошенная страница не найдена.</h2>
        </div>
    </div>

    <div class="inside">
        <div class="content">

            <p>Мы не нашли запрошенную Вами страницу. Возможно, в указанном пути к странице есть опечатка, либо Вы использовали ссылку, которая уже устарела, и страница теперь отображается по другому адресу. Для поиска нужной страницы используйте, пожалуйста, меню сайта.</p>
            <p>Мы получили сообщение о ненайденной странице и постараемся исправить эту проблему.</p>

            <ul>
                <li><a href="javascript:history.go(-1)">вернуться на предыдущую страницу</a></li>
                <li><a href="/">на главную</a></li>
            </ul>

        </div>
    </div>

    <div class="cb"><div></div></div>
</div>
