<!--гид-->
<div id="conf" title="" style="width:200px;height:50px;display:none;">
    <label>Гид отключён. Включить его Вы всегда можете в настройках профиля</label>
    <br>
    <br>
</div>
<div id="dial" class="dial" title="Добро пожаловать в систему управления Вашими финансами" style="width:400px;height:300px;display:none;">
    <div id="guide" class="guide" style="display: none;">
        <ul>
            <li>
                <a href="#bill">Шаг 1</a>
            </li>
            <li>
                <a href="#categ">Шаг 2</a>
            </li>
            <li>
                <a href="#uchet">Шаг 3</a>
            </li>
            <li>
                <a href="#plan">Шаг 4</a>
            </li>
            <li>
                <a href="#repor">Шаг 5</a>
            </li>
        </ul>
        <div id="tabs">
            <div id="bill" class="bill">
                <h3>Создайте счета!</h3>
                <div align="justify">
                    Это не обязательно банковский счет - а то место, где вы обычно храните деньги: кошелек, кредитка, банковский депозит или сейф – все это счета. Начните с основных мест хранения, которыми пользуетесь чаще всего, определите тип для каждого счета. Укажите сумму начального баланса – сколько денег находится на счете сейчас. Не забудьте выбрать валюту счета. В примечании можно указать любую дополнительную информацию.
                    <br>
                    <br>
                    Пример: <i>Если Вы пользуетесь кошельком и у Вас есть карта банка, можете завести счета с названиями «Кошелек» (тип счета «Наличные») и «Карточка» (тип счета «Кредитная карта»)</i>
                    <br>
                    <br>
                    Меню: В личном кабинете наведите указатель мыши на вкладку «Счета», в появившемся подменю щелкните «Счета», на открывшейся странице щелкните «Добавление счета». После заполнения всех параметров счета, нажмите «Сохранить».
                    <br>
                </div>
            </div>
            <div id="categ" class="categ">
                <h3>Отредактируйте или создайте категории</h3>
                <div align="justify">
                    Зарплата, премия, еда, одежда, расходы на автомобиль – это все категории, по которым можно объединять Ваши доходы или расходы, осуществлять планирование. Система уже содержит в себе стандартный набор категорий, Вы можете удалить или отредактировать существующие категории, а также добавить свои собственные. При создании категории, обязательно выберите для нее название и тип. Добавьте из списка наиболее подходящую системную категории (Это позволит системе в дальнейшем предлагать Вам советы и рекомендации).
                    <br>
                    <br>
                    Также вы может подчинить одну категорию другой, создав таким образом Подкатегорию.
                    <br>
                    <br>
                    Пример: <i>Если Вы хотите вести учет расходов на питание в разрезе нескольких видов продуктов, то можете добавить к уже существующей категории «Питание» подкатегории «Продукты», «Напитки», «Кондитерские изделия» и т.д.</i>
                    <br>
                    <br>
                    Меню: В личном кабинете наведите указатель мыши на вкладку «Счета», в появившемся подменю щелкните «Категории», на открывшейся странице щелкните «Добавить новую категорию». Или наведите указатель мыши на существующую категории и щелкните во всплывающем меню, на значок «Редактировать» или «Удалить». После заполнения \ редактирования всех параметров категории, нажмите «Сохранить».
                    <br>
                </div>
            </div>
            <div id="uchet" class="uchet">
                <h3>Ведите учет!</h3>
                <div align="justify">
                    Учитывайте движение Ваших денег, используя кнопку «Добавить операцию». Выберите счет, по которому были произведены расходы, получены доходы или совершен перевод. Выберите категорию, к которой относится данная операция. Введите сумму операции и выберите дату, в которую она была совершена. А для более детального учета используйте Комментарий и Теги (отметки для упрощения поиска похожих операций и составления отчетов по ним)
                    <br>
                    <br>
                    Пример: <i>Если Вы хотите учесть в системе покупку бензина для автомобиля при оплате банковской карточкой – укажите сумму и дату, выберите счет «Карточка», тип операции «Расход», категория «Автомобиль», подкатегория «Бензин», в комментарии можете указать, сколько литров бензина было приобретено или какой конкретно автомобиль заправляли. Используя Теги Вы сможете например, разделить расходы на личные и служебные, просто напишите в поле теги «Личные расходы», если заправляли свой автомобиль или «Служебные расходы», если заправляли служебный автомобиль.</i>
                    <br>
                    <br>
                    Меню: Ввод операции доступен с любой страницы личного кабинета сайта.
                    <br>
                </div>
            </div>
            <div id="plan" class="plan">
                <h3>Планируйте!</h3>
                <div align="justify">
                    Воспользуйтесь календарем, чтобы отметить и не забыть важное или повторяющееся событие с помощью внесения данного события в календарь. Снимите с плеч заботу об учете регулярно повторяющихся платежей, воспользовавшись регулярными транзакциями, в которых Вы можете внести все детали операции и добавить к ним дату или периодичность, в которую платеж совершается.
                    <br>
                    <br>
                    Пример: <i>Если Вы платите ежемесячно за интернет, телевидение или телефон, создайте регулярную транзакцию с параметрами этого платежа и выберите для нее периодичность повторения «Каждый месяц»</i>
                    <br>
                    <br>
                    Меню: В личном кабинете наведите указатель мыши на вкладку «Календарь», в появившемся подменю щелкните «Регулярные операции», на открывшейся странице щелкните «Добавить регулярную транзакцию». После заполнения всех данных регулярной операций, нажмите «Сохранить».
                    <br>
                </div>
            </div>
            <div id="repor" class="repor">
                <h3>Оцените результаты!</h3>
                <div align="justify">
                    Получите наглядное представление о состоянии своих финансов с помощью отчетов. Структурная диаграмма покажет, на что больше всего уходит денег, а на графике сможете определить наиболее прибыльный период. Различные варианты сравнивающих отчетов, помогут увидеть отрицательную или положительную динамику Вашего финансового состояния.
                    <br>
                    <br>
                    Пример: <i>Если Вы хотите определить структуру своих расходов за прошедший месяц, сформируйте отчет «Расходы» выбрав дату начала и дату окончания данного периода.</i>
                    <br>
                    <br>
                    Меню: В личном кабинете щелкните на вкладку «Отчёты», на открывшейся странице в выпадающем меню выберите тип отчета и его параметры. После заполнения всех данных, нажмите «Показать».
                    <br>
                </div>
            </div>
        </div>
    </div>
</div>
<!--гид-->
