<?php $texts = array (
  0 =>
  array (
    0 => 'чсячс',
    1 => '<p>Текст 1<br></p>',
    2 => '<p>sdadы<span style="font-weight: bold;">в</span>ы<span style="font-style: italic;">в</span>ыв</p>',
  ),
  1 =>
  array (
    0 => 'Заг',
    1 => 'Текст 22<br>',
    2 => 'фывфыв',
  ),
  2 =>
  array (
    0 => 'фывфыв',
    1 => 'Текст <b>bbb</b> 333',
    2 => 'ываываываы',
  ),
  3 =>
  array (
    0 => 'ваыва',
    1 => 'Текст 4444<br>',
    2 => 'ываываыв',
  ),
  4 =>
  array (
    0 => 'ывло',
    1 => 'Текст 55555<br>',
    2 => 'ывываывавы',
  ),
  5 =>
  array (
    0 => 'aaaывло',
    1 => 'Текст 666666<br>',
    2 => 'ывываывавы',
  ),
  6 =>
  array (
    0 => 'aaaыdddddвло',
    1 => 'Текст 7777777<br>',
    2 => 'ывываывавы',
  ),
  7 =>
  array (
    0 => 'aaaыxxxdddddвло',
    1 => 'Текст 88888888<br>',
    2 => 'ывываывавы',
  ),
) ?>